In [9]:
import pandas as pd
from datetime import datetime

In [20]:
df = pd.read_csv("../yellow_tripdata_2021-01.csv", low_memory=False)

In [21]:
df.head(3)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,1.0,2021-01-01 00:30:10,2021-01-01 00:36:12,1.0,2.1,1.0,N,142,43,2.0,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5
1,1.0,2021-01-01 00:51:20,2021-01-01 00:52:19,1.0,0.2,1.0,N,238,151,2.0,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0
2,1.0,2021-01-01 00:43:30,2021-01-01 01:11:06,1.0,14.7,1.0,N,132,165,1.0,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0

In [22]:
len(df)

1369765

In [31]:
df['date_column'] = pd.to_datetime(df['tpep_pickup_datetime']).dt.date

In [36]:
date_string = '2021-01-15'
datetime = datetime.strptime(date_string, '%Y-%m-%d')

In [37]:
len(df[df['date_column'] == datetime.date()])

53024

In [46]:
df.groupby(by="date_column")["tip_amount"].max().reset_index().sort_values(by="tip_amount", ascending=False).head(1)

   date_column  tip_amount
22  2021-01-20     1140.44

In [47]:
date_string = '2021-01-14'
datetime = datetime.strptime(date_string, '%Y-%m-%d')

In [48]:
df_jan_14 = df[df['date_column'] == datetime.date()]

In [52]:
df_jan_14.groupby(by="DOLocationID").count()["VendorID"].reset_index().sort_values(by="VendorID", ascending=False).head(1)

     DOLocationID  VendorID
225           236      2936

In [54]:
df_taxi_zone_lookup = pd.read_csv("../taxi_zone_lookup.csv")

In [55]:
df_taxi_zone_lookup.head(2)

   LocationID Borough            Zone service_zone
0           1     EWR  Newark Airport          EWR
1           2  Queens     Jamaica Bay    Boro Zone

In [56]:
df_taxi_zone_lookup[df_taxi_zone_lookup["LocationID"] == 236]

     LocationID    Borough                   Zone service_zone
235         236  Manhattan  Upper East Side North  Yellow Zone

In [59]:
df.groupby(by=["PULocationID", "DOLocationID"])["total_amount"].mean().reset_index().sort_values(by="total_amount", ascending=False).head(1)

     PULocationID  DOLocationID  total_amount
220             4           265        2292.4

In [60]:
df_taxi_zone_lookup[df_taxi_zone_lookup["LocationID"] == 4]

   LocationID    Borough           Zone service_zone
3           4  Manhattan  Alphabet City  Yellow Zone

In [61]:
df_taxi_zone_lookup[df_taxi_zone_lookup["LocationID"] == 265]

     LocationID  Borough Zone service_zone
264         265  Unknown  NaN          NaN